---
kind: method
id: M:Autodesk.Revit.DB.SymbolicCurve.GetVisibility
source: html/161d8b5b-c1e4-6d56-15ee-697ef002609a.htm
---
# Autodesk.Revit.DB.SymbolicCurve.GetVisibility Method

Gets the visibility for the symbolic curve.

## Syntax (C#)
```csharp
public FamilyElementVisibility GetVisibility()
```

## Returns
A copy of visibility settings for the symbolic curve.